.emacs_from_scratch_drrcool/config.org
*** Tag List
#+begin_src emacs-lisp :tangle yes
  (setq org-todo-keywords
        '((sequence "TODO(t)"
                    "NEXT(n)"
                    "WAITING(w)"
                    "SOMEDAY(s)"
                    "|"
                    "CANCELLED(c)"
                    "DONE(d)")))

  (setq org-tag-persistent-alist
        '(("Inbox" . ?i)
          ("@home" . ?h)
          ("@work" . ?w)
          ("@recovery" . ?r)
          ("@Manny" . ?m)
          ("@car" . ?c)
          ("#phone" . ?p)
          ("#computer" . ?u)))

  (setq org-tag-faces
        '(("@home" . ,rcool/green-color)
          ("@car" . ,rcool/purple-color)
          ("@work" . ,rcool/red-color)
          ("Inbox" . ,rcool/teal-color)
          ("@recovery" . ,rcool/blue-color)
          ))
#+end_src

#+RESULTS:
| @home     | , | rcool/green-color  |
| @car      | , | rcool/purple-color |
| @work     | , | rcool/red-color    |
| Inbox     | , | rcool/teal-color   |
| @recovery | , | rcool/blue-color   |

*** Custom Commands
*** Capture Templates
*** Org Mode Ui
*** Org Agenda
**** Filter out files that don't includes tasks in org agenda
I use =org-roam= to take notes, which keeps many small files.  We filter out any notes that don't includes =TODO= when forming the agenda.
#+begin_src emacs-lisp :tangle yes
  (defun rcool/define-agenda-files ()
    (interactive)
    "Return a list of note files containing 'HasTodo' tag.  I use this to denote files with tasks for org-agenda"
    (seq-uniq
     (seq-map
      #'car
      (org-roam-db-query
       [:select [nodes:file]
                :from tags
                :left-join nodes
                :on (= tags:node-id nodes:id)
                :where (in tag $v1)] '(["Project" "Area" "Daily"])))))

#+end_src
**** Remove noise from =org-agenda= views
This block sets the =org-agenda-prefix-format= in a friendly way for org-roam. It truncates long filenames and removes the =org-roam= timestamp slug.

#+begin_src emacs-lisp :tangle yes
  (defun rcool/buffer-prop-get (name)
    "Get a buffer property called NAME as a string."
    (org-with-point-at 1
      (when (re-search-forward (concat "^#\\+" name ": \\(.*\\)")
                               (point-max) t)
        (buffer-subststring-no-properties
         (match-beginning 1)
         (match-end 1)))))

  (defun rcool/agenda-category (&optional len)
    "Get category of item at point for agenda."
    (let* ((file-name (when buffer-file-name
                        (filke-name-sans-extension
                         (file-name-nondirectory buffer-file-name))))
           (title (rcool/buffer-prop-get "title"))
           (category (org-get-category))
           (result
            (or (if (and
                     title
                     (string-equal category file-name))
                    title
                  category)
                "")))
      (if (numberp len)
          (s-truncate len (s-pad-right len " " result))
        result)))

  (setq org-agenda-prefix-format
        '((agenda . " %i %(rcool/agenda-category 32)%?-32t% s")
          (todo . " %i %(rcool/agenda-category 32) ")
          (tags . " %i %(rcool/agenda-category 32) ")
          (search . " %i %(rcool/agenda-category 32) ")))
#+end_src
*** Org Super Agenda
Setup for org super agenda and org -ql
#+begin_src emacs-lisp :tangle yes
  (use-package org-super-agenda
    :after org-agenda
    :init
    (setq org-agenda-dim-blocked-tasks nil))

  ;;Dashboard View
  (setq org-super-agenda-groups
        '((:name "Priority"
                 :priority "A")
          (:name "Inbox"
                 :tag ("Inbox" "Daily"))
          (:name "Next Actions for Work"
                 :and (
                       :todo ("NEXT")
                             :tag ("Active")
                             :tag ("@work")))
          (:name "Next Actions at Home"
                 :and (
                       :todo ("NEXT")
                             :tag ("Active")
                             :tag ("@home")))
          (:name "Waiting"
                 :todo "WAITING")
          (:name "Maintenance"
                 :todo "MAINTAIN")
          (:name "Home"
                 :tag "@home")
          (:name "Work"
                 :tag "@work")
          (:name "Productivity"
                 :tag "Productivity")
          (:name "Someday"
                 :todo "SOMEDAY")))
  (org-super-agenda-mode)
#+end_src


** Configure Babel Languages
** Org Special Blocks
** Table of Contents
** Create Template Snippets
** Auto Tangle Configuration Files
** Org Aalert
** Org Wild Notifier
** Org Tree Slide
** Org Roam
*** Basic Setup
#+begin_src emacs-lisp :tangle yes
  (use-package org-roam
    :straight (:host github :repo "org-roam/org-roam"
                     :files (:defaults "extensions/*"))
    :init
    (setq org-roam-v2-ack t)


    (add-to-list 'display-buffer-alist
                 '("\\*org-roam\\*"
                   (display-buffer-in-direction)
                   (direction . right)
                   (window-width . 0.33)
                   (window-height . fit-window-to-buffer)))
    (org-roam-db-autosync-mode)
    :config

    ;; Roam daily and project files only
    (setq org-agenda-files (rcool/define-agenda-files))
    :custom
    (org-roam-directory (file-truename "~/org/roam"))
    (org-roam-dailies-directory "daily/")
    (org-roam-completion-everywhere t)
    :general
    (rcool/leader-keys
      :states '(normal visual motion)
      :prefix "SPC"
      "" nil
      "X" '(org-roam-capture :wk "Roam Capture") 
      "d" '(:ignore t :which-key "+Daily Notes")
      "d t" '(org-roam-dailies-goto-today :wk "Today's Daily Note")
      "d y" '(org-roam-dailies-goto-yesterday :wk "Yesterday's Daily Note")
      "a" '(rcool/define-agenda-files :wk "Refresh Agenda DB"))
    (rcool/local-leader-keys
      :states '(normal visual motion)
      :keymaps 'org-mode-map
      "r" '(:ignore t :which-key "+Roam")
      "b" '(:ignore t :wk "+Babel")
      "b t" '(org-babel-tangle :wk "Tangle")
      "i" '(completion-at-point :wk "Completion at Point")
      "r f" '(org-roam-node-find :wk "Find Node")
      "r i" '(org-roam-node-insert :wk "Insert Node")
      "r c" '(rcool/org-roam-create-id :wk "Create Roam ID")
      "r p" '(org-roam-dailies-goto-previous-note :wk "Prev Daily Note")
      "r n" '(org-roam-dailies-goto-next-note :wk "Next Daily Note")
      "r b" '(org-roam-buffer-toggle :wk "Toggle Buffer")
      ))
#+end_src

#+RESULTS:

*** Configure Templates
#+begin_src emacs-lisp :tangle yes
  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
           "* %?"p
           :if-new (file+head "%<%Y-%m-%d>.org"
                              "#+TITLE: %<%Y-%m-%d>\n#+filetags: Daily\n\n"))))
#+end_src

#+RESULTS:
| d | default | entry | * %? | p | :if-new | (file+head %<%Y-%m-%d>.org #+TITLE: %<%Y-%m-%d> |

*** Extending Roam
Here, we add additional function to org-roam to either do something specific for more workflow or otherwise make =org-roam= more fully features.

**** Set CREATED and LAST_MODIFIED filetags on save
#+begin_src emacs-lisp :tangle yes
  (defvar rcool/org-created-property-name "CREATED")

  (defun rcool/org-set-created-property (&optional active name)
    (interactive)
    (let* ((created (or name rcool/org-created-property-name))
           (fmt (if active "<%s>" "[%s]"))
           (now (format fmt (format-time-string "%Y-%m-%d %a %H:%M"))))
      (unless (org-entry-get (point) created nil)
        (org-set-property created now)
        now)))

  (defun rcool/org-find-time-file-property (property &optional anywhere)
    (save-execursion
     (goto-char (point-min))
     (let ((first-heading
            (save-excursion
              (re-search-forward org-outline-regexp-bol nil t))))
       (when (re-search-forward (format "^#\\+%s:" property)
                                (if anywhere nil first-heading) t)
         (point)))))

  (defun rcool/org-has-time-file-property-p (property &optional anywhere)
    (when-let ((pos (rcool/org-find-time-file-property property anywhere)))
      (save-excursion
        (goto-char pos)
        (if (and (looking-at-p " ")
                 (progn (forward-char)
                        (org-at-timestamp-p 'lax)))
            pos -1))))


  (defun rcool/org-set-time-file-property (property &optional anywhere pos)
    (when-let ((pos (or pos
                        (rcool/org-find-time-file-property property))))
      (save-excursion
        (goto-char pos)
        (if (looking-at-p " ")
            (forward-char)
          (insert " "))
        (delete-region (point) (line-end-position))
        (let* ((now (format-time-string "[%Y-%m-%d %a %H:%M]")))
          (insert now)))))

  (defun rcool/org-set-last-modified ()
    "Update the LAST_MODIFIED file property in the preamble."
    (when (derived-mode-p 'org-mode)
      (rcool/org-set-time-file-property "LAST_MODIFIED")))
#+end_src

**** Set CREATED on node creation
#+begin_src emacs-lisp :tangle yes
  (defun rcool/org-roam-create-id ()
   (interactive)
   (org-id-get-create)
   (rcool/org-set-created-property))
#+end_src

#+RESULTS:
: rcool/org-roam-create-id

**** Quick log entry header
#+begin_src emacs-lisp :tangle yes
  (defvar current-time-format "%H:%M:%S"
    "Format of date to insert with `insert-current-time' function.
  Note the weekly scope of the command's precision.")

  (defun insert-current-time ()
    "Insert the current time (1-week scope) into the current buffer."
    (interactive)
    (insert "* ")
    (insert (format-time-string current-time-format (current-time)))
    (insert "\n")
    )

  (rcool/leader-keys
    :states '(normal visual motion)
    :keymap 'org-mode-map
    "," '(insert-current-time :wk "current time"))
#+end_src

#+RESULTS:

