.emacs_from_scratch_drrcool/config.org
*** Roam Capture Templates
These are templates used to create new nodes.

#+begin_src emacs-lisp :tangle yes
  (setq org-roam-capture-templates
        '(("d" "default" plain
           "%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n\n")
           :unnarrowed t)
          ("a" "area" plain
           "#+filetags: Area\n\n* Goals\n\n%^{Goals}\n\n* Tasks\n\n** TODO %?"
           :if-new (file+head "%<%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}")
           :unnarrowed t)
          ("j" "project" plain
           "#+filetags: Project\n\n* Goals\n\n%^{{Goals}\n\n* Tasks\n\n TODO %?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}")
           :unnarrowed t)
          ("p" "people" plain
           "#+filetags: People CRM\n\n* Contacts\n\nRelationship: %^{Relationship}\nPhone:\nAddress\nBirthday\n\n* Notes\n\n %?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}")
           :unnarrowed t)
          ("i" "institution" plain
           "#+filetags: Institution CRM\n\n* Contracts\n\nRelationship: %^{Relationship}\nPhone:\nAddress\n\n* Notes\\n %?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}")
           :unnarrowed t)
          ))
#+end_src

#+RESULTS:
| d | default | plain | %? | :if-new | (file+head %<%Y%m%d%H%M%S>-${slug}.org #+title: ${title} |

*** UI Improvments

***** Change default bullets to be pretty
#+begin_src emacs-lisp :tangle yes
  (use-package org-superstar
    :after org
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '("•" "•" "•" "◦" "◦" "◦" "◦")))

#+end_src

#+RESULTS:
| org-superstar-mode | org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | rcool/org-mode-setup | org-eldoc-load |


#+end_src



* Markdown mode
* revealjs
* Emojis
* Utilities
** Counsel OSX App
** Speed Type
** Bluetooth
* Development
** Languages
*** Language Server
**** Basic Setup
**** LSP UI
**** LSP Ivy
**** LSP Treemacs
*** Dap Mode
*** Programming Languages
**** typescript
**** javascript
**** html
**** css
**** python
**** yaml
**** markdown
** Copilot
** flycheck
** company mode
** projectile
** magit
*** Configuration
** git-gutter
** lorem-ipsum
** commenting lines
** keybindings
** darkroom
** Snippets
#+begin_src emacs-lisp :tangle yes
(use-package yasnippet
  :init
  (yas-global-mode 1)
  :config
  (setq yas-snippet-dirs
        '("~/.emacs_from_scratch_drrcool/snippets"))
  )
#+end_src

* Credential Management
* Calendar Sync
* Music
** Spotify
* Terminal
** term-mode
** colors
** vterm
** eshell
*** configure
*** fish completion
*** command highlighting
*** history autocompletion
*** eshell toggle
* Buffer Management With Bufler
* File Management
** Dired
*** Keybindings
**** Navigation
**** Marking Files
**** Copying and Renaming Files
**** Deleting Files
**** Creating and Extracting Archives
**** Other Common Operations
*** Basic Config
*** Dired Single
*** All the icons
*** Open External Files
*** Hide/Show Dotfiles
*** Dired Rainbow
* Calendar
* Window Management
* Cricket
